src/config/InformationRegisters/РасположениеФирм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РасположениеФирм</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/InformationRegisters/АктуальностьОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>АктуальностьОрганизаций</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Активна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/InformationRegisters/СвязьОрганизаций8ИСчетов7.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СвязьОрганизаций8ИСчетов7</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Счет7</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета7</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация8</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФамилияИП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяИП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчествоИП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическоеФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮридическоеФизическоеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодБСВМММ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета7</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВБазе8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтветственныеБухгалтеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаУТП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/config/CommonModules/мммСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция - Запрос прокси
// 
// Возвращаемое значение:
//  Стукрура - структура с параметрами ТекстЗапроса, Параметры
//
Функция ЗапросПрокси() Экспорт
	
	Возврат Новый Структура("ТекстЗапроса, Параметры", "", Новый Структура);
	
КонецФункции	

// Функция - Получить прокси
//
// Параметры:
//  Сервер		 - Строка	 - 
//  База		 - Строка	 - 
//  Пользователь - Строка	 - 
//  Пароль		 - Строка	 - 
// 
// Возвращаемое значение:
// 	WSПрокси
//
Функция ПолучитьПрокси(Сервер, База, Пользователь = "Robot", Пароль = "bot") Экспорт
	
	ПараметрыПрокси = ОбщегоНазначения.ПараметрыПодключенияWSПрокси();
	ПараметрыПрокси.АдресWSDL = "http://"+Сервер+"/"+База+"/ws/MMMservice.1cws?wsdl";
	ПараметрыПрокси.URIПространстваИмен = "http://www.1c.ru";
	ПараметрыПрокси.ИмяСервиса = "MMMservice";
	ПараметрыПрокси.Пароль = Пароль;
	ПараметрыПрокси.ИмяПользователя = Пользователь;
	ПараметрыПрокси.ИмяСервиса = "MMMservice";
	ПараметрыПрокси.Таймаут = Константы.ТаймаутПодключенияКВебсервису.Получить();
	ПараметрыПрокси.Местоположение = "http://"+Сервер+"/"+База+"/ws/MMMservice.1cws";
	  
	Возврат ОбщегоНазначения.СоздатьWSПрокси(ПараметрыПрокси);	
	
КонецФункции

// Функция - Сериализовать
//
// Параметры:
//  Об	 - Объект	 - 
// 
// Возвращаемое значение:
//   Строка 
//
Функция Сериализовать(Об) Экспорт
	
	Возврат СериализоватьВСтрокуJSON(Об);
	
КонецФункции

// Функция - Де сериализовать
//
// Параметры:
//  Стр	 - Строка	 - 
// 
// Возвращаемое значение:
//   Объект 
//
Функция ДеСериализовать(Стр) Экспорт
	
	Возврат ДеСериализоватьИзСтрокиJSON(Стр);
	
КонецФункции	

// Функция - Получить таблицу серверов
//
// Параметры:
//  Период			 - Дата - Период актуальности
//  ОтборОрганизация - СправочникСсыка.Организации, Массив - 
// 
// Возвращаемое значение:
//  ТаблицаЗначений - 
//
Функция ПолучитьТаблицуСерверов(Период, ОтборОрганизация = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Организации.Ссылка КАК Организация,
				   |	Организации.Ссылка КАК Ссылка,
	               |	РасположениеФирм.Сервер КАК Сервер,
	               |	РасположениеФирм.ИмяБазы КАК База,
	               |	РасположениеФирм.Логин КАК Пользователь,
	               |	РасположениеФирм.Пароль КАК Пароль,
	               |	ЕСТЬNULL(СвязьОрганизаций.Счет7, ЗНАЧЕНИЕ(Справочник.Счета7.ПустаяСсылка)) КАК Счет7,
	               |	ЕСТЬNULL(Актуальность.Активна, ЛОЖЬ) КАК Пометка,
	               |	Организации.Бухгалтер КАК Бухгалтер,
	               |	Организации.БазаУТП КАК БазаУТП,
	               |	Организации.ЮридическоеФизическоеЛицо КАК ЮридическоеФизическоеЛицо,
	               |	Организации.Наименование КАК Наименование,
	               |	Организации.НаименованиеПолное КАК НаименованиеПолное
	               |ИЗ
	               |	Справочник.Организации КАК Организации
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасположениеФирм.СрезПоследних(&Период, ) КАК РасположениеФирм
	               |		ПО Организации.Ссылка = РасположениеФирм.Организация
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АктуальностьОрганизаций.СрезПоследних(&Период, ) КАК Актуальность
	               |		ПО Организации.Ссылка = Актуальность.Организация
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязьОрганизаций8ИСчетов7.СрезПоследних(&Период, ) КАК СвязьОрганизаций
	               |		ПО Организации.Ссылка = СвязьОрганизаций.Организация8
	               |ГДЕ
	               |	НЕ Организации.ЭтоГруппа
	               |	И ИСТИНА";

	Если ЗначениеЗаполнено(ОтборОрганизация) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ИСТИНА", "И Организации.Ссылка В ИЕРАРХИИ(&Организация)");
		Запрос.УстановитьПараметр("Организация", ОтборОрганизация);
	КонецЕсли;

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ПрочитатьФайлНаСервере(АдресФайла, ТабДок, РасширениеФайла) Экспорт
		
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайла);
	ПолноеИмяФайла = ПолучитьИмяВременногоФайла(".xls");
	
	Если НЕ ЗначениеЗаполнено(ДвоичныеДанные) Тогда
		Возврат Ложь;
	КонецЕсли;	
		
	ДвоичныеДанные.Записать(ПолноеИмяФайла);	
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Очистить();
	Попытка
		ТабДок.Прочитать(ПолноеИмяФайла);
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Функция ПодключитьсяКБазеМММСервер(Пользователь = "Robot", Пароль = "bot") Экспорт

	ПутьКБазе = мммСервер.ЗначениеКонстанты("ПутьКБазеМММ");
	Если ПустаяСтрока(ПутьКБазе) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		База = Новый COMОбъект("v77.Application");
		//База = Новый COMОбъект("V1СEnterprise.Application");
	Исключение
		#Если Клиент Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеОшибки());
		#КонецЕсли
		Возврат Неопределено;
	КонецПопытки;
	
	СтрокаПодключения = "/D""" + СокрЛП(ПутьКБазе) + """ /N""" + СокрЛП(Пользователь) + """ /P""" + СокрЛП(Пароль) + """";
	
	// Попытка 1
	РезультатПодключения = База.Initialize(База.RMTrade, СтрокаПодключения, "NO_SPLASH_SHOW");
	Если РезультатПодключения Тогда
		Возврат База;
	КонецЕсли;
	
	// Попытка 2
	РезультатПодключения = База.Initialize(База.RMTrade, СтрокаПодключения, "NO_SPLASH_SHOW");
	Если РезультатПодключения Тогда
		Возврат База;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция УдалитьДублиСтрокТаблицыЗначений(Таблица, Колонки = "") Экспорт

	Если ПустаяСтрока(Колонки) Тогда
		
		// Просто свернем таблицу по всем колонкам
		
		Для каждого Колонка Из Таблица.Колонки Цикл
			Колонки = Колонки + ?(ПустаяСтрока(Колонки), "", ",") + Колонка.Имя;
		КонецЦикла;
		
		ТаблицаРезультат = Таблица.Скопировать();
		ТаблицаРезультат.Свернуть(Колонки);
		
	Иначе
		
		КолонкиЗапроса = "ТЗ." + СтрЗаменить(Колонки, ",", ",ТЗ.");
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
					   |	" + КолонкиЗапроса + "
					   |ПОМЕСТИТЬ ВТ_ТЗ
					   |ИЗ
					   |	&ТЗ КАК ТЗ
					   |;
					   |
					   |////////////////////////////////////////////////////////////////////////////////
					   |ВЫБРАТЬ РАЗЛИЧНЫЕ
					   |	" + СтрЗаменить(КолонкиЗапроса, "ТЗ.", "ВТ_ТЗ.") + "
					   |ИЗ
					   |	ВТ_ТЗ КАК ВТ_ТЗ
					   |";

		Запрос.УстановитьПараметр("ТЗ", Таблица);
		РезультатЗапроса = Запрос.Выполнить();
		ТаблицаЗапроса = РезультатЗапроса.Выгрузить();
		ТаблицаРезультат = Таблица.СкопироватьКолонки();
		Для каждого СтрокаТЗ Из ТаблицаЗапроса Цикл
		
			СтруктураОтбора = Новый Структура(Колонки);
			ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаТЗ);
			
			РезультатОтбора = Таблица.НайтиСтроки(СтруктураОтбора);
			Для каждого СтрокаОтбора Из РезультатОтбора Цикл
				
				НоваяСтрока = ТаблицаРезультат.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОтбора);
				Прервать;
				
			КонецЦикла;
		
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТаблицаРезультат;

КонецФункции // УдалитьДублиСтрокТаблицыЗначений()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗначениеКонстанты(ИмяКонстанты) Экспорт
	
	Возврат Константы[ИмяКонстанты].Получить();
	
КонецФункции	

Функция СериализоватьВСтрокуJSON(Об)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	параметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
	ЗаписьJSON.УстановитьСтроку(параметрыЗаписиJSON);
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, Об, НазначениеТипаXML.Явное);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции


Функция ДеСериализоватьИзСтрокиJSON(Стр)
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Стр);
	Данные = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат Данные;
	
КонецФункции

#КонецОбласти

Процедура ВнешниеНаборыДанныхЗапускВыполнения(Параметры, АдресХранилища) Экспорт
	
	Результат = Отчеты.ВНД.ВнешниеНаборыДанных(Параметры.ДатаНач, Параметры.ДатаКон, Параметры.Организация);
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
	
КонецПроцедуры
